[
    {
        "title": "Realme Note 80 surfaces, here's how fast it will charge",
        "link": "https://www.gsmarena.com/realme_note_80_surfaces_heres_how_fast_it_will_charge-news-71216.php",
        "pubDate": "Fri, 23 Jan 2026 03:33:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/realme-note-80-certified/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>The Realme Note 70 was launched last summer, and now the brand is already working on its successor, which will unsurprisingly be called Realme Note 80. This device has now been certified for sale in Malaysia by SIRIM, the local authority in charge.\n\n\n\nIt has the model number RMX5388, and that is all that the certification reveals - it basically ties the commercial name to the model number. Now that we know that the RMX5388 is the Note 80, we know that it's also received the EEC and TKDN certifications.\n\n\n\nA listing at Element Materials Technology has revealed that it will support 15W...</p>",
        "category": "news"
    },
    {
        "title": "Oppo Find X9 Ultra's back showcased in new images",
        "link": "https://www.gsmarena.com/oppo_find_x9_ultras_back_showcased_in_new_images-news-71219.php",
        "pubDate": "Fri, 23 Jan 2026 01:47:01 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/oppo-find-x9-ultra-images/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>A couple of days ago some images leaked purportedly showing the upcoming Oppo Find X9 Ultra with a telephoto extender, but those only showed the device's front.\n\nToday a new leak purportedly brings us our first look at its back, and it's definitely an interesting design that clearly wants to instantly make you think of digital cameras. Note that these aren't leaked images, they're allegedly created based on the design (with the help of AI, most likely).\n\n\n\n\nOppo Find X9 Ultra \n\nAs you can see, the gigantic camera island is a circle that takes up almost the entirety of the rear's...</p>",
        "category": "news"
    },
    {
        "title": "Google expands Personal Intelligence to AI Mode in Search",
        "link": "https://www.gsmarena.com/google_expands_personal_intelligence_to_ai_mode_in_search-news-71218.php",
        "pubDate": "Thu, 22 Jan 2026 23:51:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/personal-intelligence-in-google-search-ai-mode/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>A week ago, Google launched Personal Intelligence inside Gemini, and today the company is announcing that the feature has also made it to Google Search's AI Mode.\n\nIn AI Mode, Personal Intelligence lets you connect Gmail and Google Photos to get AI results that are personalized based on your emails and photos. This is available for Google AI Pro and Google AI Ultra subscribers in English in the US, and it's opt-in as a Labs feature. To turn it on, go to Google Search, tap your profile, choose Search personalization, select Connected Content Apps, and then connect Workspace and Google...</p>",
        "category": "news"
    },
    {
        "title": "South Korea passes the first AI regulations",
        "link": "https://www.gsmarena.com/south_korea_regulates_ai_before_anyone_else-news-71217.php",
        "pubDate": "Thu, 22 Jan 2026 22:22:03 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/south-korea-regulates-ai/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>South Korea has launched a landmark set of laws to regulate AI before any other country or bloc (the EU's regulations are set to go into effect in stages through next year).\n\nUnder Korea's AI Basic Act, companies must ensure there is human oversight for \"high-impact\" AI in fields like nuclear safety, drinking water, transport, healthcare, and financial uses like credit evaluation and loan screening.\n\n\n\nCompanies must also give users advance notice about products or services using high-impact or generative AI, and clearly label AI-generated output that is difficult to distinguish from...</p>",
        "category": "news"
    },
    {
        "title": "Galaxy S26 Ultra could debut a new high-strength Gorilla Glass",
        "link": "https://www.gsmarena.com/galaxy_s26_ultra_could_debut_a_new_highstrength_gorilla_glass-news-71214.php",
        "pubDate": "Thu, 22 Jan 2026 21:01:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/galaxy-s26-ultra-new-gorilla-glass-leak/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>The Galaxy S26 Ultra is rumored to sport an upgraded display with features such as Privacy Display. Now, a new leak suggests that the screen will come with improved protection as well.\n\nAccording to prolific leaker Ice Universe, the Galaxy S26 Ultra’s display will get a new generation ‘high-strength’ Gorilla Glass.\n\n\nAnti-reflective coating on the Galaxy S25 Ultra and Galaxy S24 Ultra.\n\nThe Galaxy S25 Ultra already uses an anti-reflective display coating that largely removes the need for matte screen protectors. Now, the rumored Privacy Display feature on the Galaxy S26 Ultra could...</p>",
        "category": "news"
    },
    {
        "title": "Spotify's Prompted Playlist feature expands to North America",
        "link": "https://www.gsmarena.com/spotifys_prompted_playlist_feature_expands_to_north_america-news-71213.php",
        "pubDate": "Thu, 22 Jan 2026 19:31:03 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/spotify-prompted-playlist-us-canada/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>Last month, Spotify launched its Prompted Playlist feature that gives you greater control over its playlist algorithm, and today the availability of this feature is expanding.\n\nIt is now rolling out to Premium subscribers in the US and Canada, following the initial rollout in New Zealand. The feature is still in beta.\n\n\n\nWith Prompted Playlist, you can describe what you want to listen to using your own words. Think of it as ChatGPT (or Gemini, you get the idea) for music. Once you say what you want, a playlist will be generated based on your prompt. It also takes your listening history...</p>",
        "category": "news"
    },
    {
        "title": "Honor sets MWC event, confirms Magic V6 and Robot Phone official debut",
        "link": "https://www.gsmarena.com/honor_sets_mwc_event_confirms_magic_v6_and_robot_phone_official_debut_-news-71215.php",
        "pubDate": "Thu, 22 Jan 2026 18:01:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/honor-mwc-2026-event-confirmed/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>This year’s MWC Barcelona is taking place at the beginning of March, and Honor already confirmed its presence with a dedicated event, which will see the debuts of the Magic V6 foldable and the Honor Robot Phone.\n\nHonor’s launch event is set to take place on March 1 at the Palau de Congressos de Barcelona and will start at 1PM CET time.\n\n\nHonor Magic V5\n\nMagic V6 is expected to launch with a sizeable battery upgrade over its predecessor. According to the latest rumor, the foldable will bring a Si/C battery cell with a capacity in the 7,000 mAh range. The device is also expected to...</p>",
        "category": "news"
    },
    {
        "title": "vivo V70 FE's chipset, memory amount, and battery capacity revealed",
        "link": "https://www.gsmarena.com/vivo_v70_fes_chipset_memory_amount_and_battery_capacity_revealed-news-71212.php",
        "pubDate": "Thu, 22 Jan 2026 16:44:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/vivo-v70-fe-eprel-geekbench/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>vivo's upcoming V70 family will be quite large, and one of its members is the V70 FE. This one has the model number V2550, as revealed by a certification earlier this month.\n\nNow the V70 FE has received its European Energy Label, which reveals that it comes with a 7,000 mAh battery. This will be the typical advertised capacity, whereas the rated capacity is 6,870 mAh.\n\n\n\nThe battery will last 1,600 cycles before it goes below 80% of its initial capacity. The phone will support 55W wired charging, and it's IP68 certified for dust and water resistance. It received a C (on a scale of A to...</p>",
        "category": "news"
    },
    {
        "title": "Samsung is saving its best displays for iPhones, not Galaxies",
        "link": "https://www.gsmarena.com/samsung_is_saving_its_best_displays_for_iphones_not_galaxies-news-71208.php",
        "pubDate": "Thu, 22 Jan 2026 15:41:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/25/12/apple-third-party-payments-app-stores-brazil/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>A new rumor from China suggests that Samsung will be supplying Apple with its very best OLED panels for the iPhone 18 lineup. Reportedly, they will be significantly brighter and BOE is struggling to meet Apple's brightness requirements, so panel production will be shifted to Samsung and possibly LG as well.\n\n\n\nThis report is in line with recent information about Samsung's LTPO+ panels being the staple for the upcoming iPhone 18 Pro and 18 Pro Max. And in that same report, BOE is once again singled out as the weak link in Apple's supply chain since only Samsung and LG have the technology...</p>",
        "category": "news"
    },
    {
        "title": "Realme Neo8 comes with Snapdragon 8 Gen 5, an 8,000mAh battery, and an IP69 rating",
        "link": "https://www.gsmarena.com/realme_neo8_comes_with_snapdragon_8_gen_5_an_8000mah_battery_and_ip69_rating-news-71211.php",
        "pubDate": "Thu, 22 Jan 2026 14:41:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/realme-neo8-ofic/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>The Realme Neo8 has just gone official in China. It is the latest entry in the Neo series and comes with a large 8,000mAh battery and the Snapdragon 8 Gen 5 chipset. The phone is available for purchase in three colors.\n\nIt sports a 6.78-inch AMOLED display with a Full-HD+ resolution and a refresh rate of up to 165Hz. The Neo8 uses the Samsung M14 panel that is claimed to deliver a peak brightness of 6,500 nits.\n\n\n\nAt the back, the phone features a transparent design with the ‘Awakening Halo’ RGB light strip that corresponds to notifications and more. The rear panel is made from glass...</p>",
        "category": "news"
    },
    {
        "title": "Apple's next wearable tipped to be an AI pin with cameras",
        "link": "https://www.gsmarena.com/apples_next_wearable_could_be_an_ai_pin_with_cameras-news-71206.php",
        "pubDate": "Thu, 22 Jan 2026 13:07:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/apple-ai-pin-report/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>Fancy an Apple-branded wearable AI pin? A new report suggests Apple is working on a compact AI-powered pin, roughly the size of an AirTag. If it makes it to market, the device would mark Apple’s first product built primarily around AI and could run the revamped Siri chatbot.\n\nAccording to a report from The Information, the wearable is still in development, though the project could face delays or even be shelved altogether.\n\n\nAn AI-generated image of the rumored Apple AI pin.\n\nThe AI pin is reportedly circular in shape, closely resembling the AirTag in both size and design, with an...</p>",
        "category": "news"
    },
    {
        "title": "Report claims Honor Magic V6 will have the largest battery on a foldable",
        "link": "https://www.gsmarena.com/honor_magic_v6_battery_capacity_tipped_again-news-71207.php",
        "pubDate": "Thu, 22 Jan 2026 12:41:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/honor-magic-v6-battery-capacity-tipped-again/-184x111/gsmarena_001.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>The Honor Magic V5 launched last July shipped with a 6,100 mAh Si/C battery in China, while other markets got the foldable with a 5,820 mAh Si/C battery. Honor hasn't revealed the Magic V6's launch date yet, but some of its specs have already surfaced online, with the latest rumor talking about its battery.\n\n[#InlinePriceWidget,13982,1#]\n\nAccording to tipster Digital China Station, the Honor Magic V6 will have a battery with a capacity of at least 7,000 mAh, which, if true, would make the V6 a foldable with the highest battery capacity.\n\n\nMachine translated from Chinese to...</p>",
        "category": "news"
    },
    {
        "title": "NexPhone is a desktop replacement smartphone that multi-boots Android, Linux and Windows 11",
        "link": "https://www.gsmarena.com/nexphone_is_a_desktop_replacement_smartphone_that_multiboots_android_linux_and_windows_11__-news-71205.php",
        "pubDate": "Thu, 22 Jan 2026 11:22:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/nexphone-ofic/-184x111/gsmarena_00.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>Nex Computer has been tinkering with ways to get more use out of smartphones for the better half of a decade. The company’s NexDock lineup allows compatible Android phones to power a laptop-style shell for added productivity on the go and its latest attempt is the NexPhone. This is an Android 16 smartphone that also boots Linux (Debian) and Windows 11 and can serve as your one and only computing device.\n\n\n\n\nThe key here is the custom NexOS, which includes Linux as an app inside its Android interface, which you can freely launch on the go. You also get the option to boot into the...</p>",
        "category": "news"
    },
    {
        "title": "Huawei introduces nova 15 x ROBBi edition",
        "link": "https://www.gsmarena.com/huawei_nova_15_ultra_robbi_gift_box-news-71204.php",
        "pubDate": "Thu, 22 Jan 2026 10:25:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/huawei-nova-15-ultra-robbi-gift-box/-184x111/gsmarena_001.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>Huawei unveiled the nova 15 series last month in China, which includes the nova 15, nova 15 Pro, and nova 15 Ultra. Alongside these, Huawei had teased a collaboration with ROBBi Global for ROBBi-based themes on the nova 15 smartphones. Now, Huawei has announced a limited edition nova 15 x ROBBi gift box, which includes ROBBi goodies.\n\nROBBi is a Chinese designer art toy, and the ROBBi gift box Huawei announced will include a ROBBi toy, a sticker, a flight tag bag, and a phone case.\n\n\n\nThe ROBBi gift box will only be available with the nova 15 Ultra, which will come with ROBBi-based...</p>",
        "category": "news"
    },
    {
        "title": "Apple to turn Siri into a full-fledged chatbot with iOS 27, report claims",
        "link": "https://www.gsmarena.com/apple_to_turn_siri_into_a_fullfledged_chatbot_with_ios_27_report_claims-news-71203.php",
        "pubDate": "Thu, 22 Jan 2026 08:36:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/siri-chatbot-ios-27-report/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>Following confirmation that Google’s Gemini will power Siri’s upcoming revamp, a new report claims Apple will introduce a chatbot-style version of the assistant with its next major software updates.\n\nA Bloomberg report claims Apple is working on a new Siri chatbot, internally codenamed Campos, that will roll out with iOS 27, macOS 27, and iPadOS 27 and replace the existing Siri.\n\n\n\nThe report states that the Siri chatbot will function as a standalone app built into Apple devices. It will support natural language conversations similar to ChatGPT and Gemini, and can be invoked using the...</p>",
        "category": "news"
    },
    {
        "title": "iQOO 15 Ultra design and colors teased, launch timeline confirmed",
        "link": "https://www.gsmarena.com/iqoo_15_ultra_design_and_colors_teased_launch_timeline_confirmed-news-71202.php",
        "pubDate": "Thu, 22 Jan 2026 06:17:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/iqoo-15-ultra-design-colors/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>iQOO has officially teased the iQOO 15 Ultra, its next gaming-focused smartphone, offering a first look at the device’s design and colour options while also confirming its launch timeline in China.\n\nIn a Weibo post, the brand confirmed that the iQOO 15 Ultra will make its debut in China in early February. The vivo sub-brand also revealed the handset’s design in two colour options.\n\n\n\nThe rear of the phone closely resembles that of the iQOO 15, but it features a honeycomb-like pattern on the back panel and a redesigned camera module. Notably, the lower section of the camera housing...</p>",
        "category": "news"
    },
    {
        "title": "Sony LinkBuds Clip are here with clip-on design, nine-hour battery life",
        "link": "https://www.gsmarena.com/sony_linkbuds_clip_are_here_with_clipon_design_ninehour_battery_life-news-71201.php",
        "pubDate": "Thu, 22 Jan 2026 05:07:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/sony-linkbuds-clip-official/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>Sony's latest earbuds are the LinkBuds Clip. As the name implies, these are of the clip-on variety, a design that has become more and more popular with earbud makers recently.\n\nThe main upside of this design is that you can hear your music (or whatever's playing through the buds) as well as your surroundings. Sony says it designed these for \"a comfortable, stable fit across a variety of ear types with removable Fitting Cushions, ideal to wear throughout the day\".\n\n\n\nThe LinkBuds Clip have three listening modes: Standard, Voice Boost, and Sound Leakage Reduction. The app supports a...</p>",
        "category": "news"
    },
    {
        "title": "Here's how the iQOO 15 Ultra's huge active cooling fan will work",
        "link": "https://www.gsmarena.com/heres_how_the_iqoo_15_ultras_huge_active_cooling_fan_will_work-news-71200.php",
        "pubDate": "Thu, 22 Jan 2026 03:09:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/iqoo-15-ultra-fan/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>The iQOO 15 Ultra is launching soon and it's rumored to boast the biggest active cooling fan ever put into a smartphone. Today the prolific leaker who goes by Digital Chat Station on Weibo has shared the image you can see below, showing a schematic of the device and the fan.\n\nThe air intake for the fan is positioned at the bottom of the camera island, while the air outlet is positioned on the side, in the frame. The fan itself is alleged to measure 17mm in diameter and 4mm thick, and it's once again claimed to be the biggest in the industry.\n\n\n\nIn addition to the fan, there's also a big...</p>",
        "category": "news"
    },
    {
        "title": "OnePlus 15T camera, screen, and charging details leak",
        "link": "https://www.gsmarena.com/oneplus_15t_camera_screen_and_charging_details_leak-news-71197.php",
        "pubDate": "Thu, 22 Jan 2026 01:11:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/oneplus-15t-cameras-screen-charging/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>The OnePlus 15T is rumored to be launching in March, and today some more details about its screen and cameras have been leaked in China. According to Digital Chat Station on Weibo, the 15T has a 6.32-inch screen with \"1.5K\" resolution, a 50MP main camera, a 50MP telephoto camera, and a 16MP selfie camera.\n\nThere's no third camera on the back, just like we saw with the OnePlus 13T, which came last April. In fact, its successor's cameras seem identical, at least in resolution. Of course, there's always a chance of an update to the sensors or the processing, or both.\n\n\nOnePlus 13T\n\nThe...</p>",
        "category": "news"
    },
    {
        "title": "More Google Pixel 10a renders leak",
        "link": "https://www.gsmarena.com/more_google_pixel_10a_renders_leak-news-71198.php",
        "pubDate": "Wed, 21 Jan 2026 23:37:02 +0100",
        "description": "<img align=\"left\" alt=\"\" border=\"0\" height=\"111\" hspace=\"3\" src=\"https://fdn.gsmarena.com/imgroot/news/26/01/google-pixel-10a-more-renders/-184x111/gsmarena_000.jpg\" style=\"background: #333333; padding: 0px; margin: 0px 4px 0px 0px; border-style: solid; border-color: #aaaaaa; border-width: 1px;\" width=\"184\" /> <p>We've already seen the upcoming Google Pixel 10a first in CAD-based renders, then in a purportedly official image that got leaked, and today there's a new round of renders to look at. These show the phone from more angles.\n\nThe design, as you can see once again, is heavily inspired by that of the Pixel 9a from last year, if not downright identical. The Pixel 10a could arrive on February 17.\n\n\n\n\n\n\n\nGoogle Pixel 10a in new renders\n\nThe weird thing is that the Pixel 10a may very well have entirely identical specs to its predecessor, at least according to what's been leaked so far....</p>",
        "category": "news"
    }
]