[

{
  "lesson": 49,
  "title": "みんなの日本語 第49課：〜ようにする・〜ようになる・〜ように見える／聞こえる",
  "english_title": "Minna no Nihongo Lesson 49: Make an effort to (~you ni suru), Come to be able to (~you ni naru), Seem/look/sound like (~you ni mieru/kikoeru)",
  "level": "N4",
  "connection_structure": {
    "you_ni_suru": {
      "form": "〜ようにする (Make an effort to / try to do regularly)",
      "rules": [
        {
          "base": "動詞辞書形 + ようにする",
          "example": "勉強する → 勉強するようにする",
          "example_en": "study → make an effort to study"
        },
        {
          "base": "動詞ない形 + ようにする",
          "example": "忘れる → 忘れないようにする",
          "example_en": "forget → try not to forget"
        }
      ]
    },
    "you_ni_naru": {
      "form": "〜ようになる (Come to be able to / become possible / it turns out that)",
      "rules": [
        {
          "base": "動詞辞書形 + ようになる",
          "example": "話せる → 話せるようになる",
          "example_en": "be able to speak → come to be able to speak"
        },
        {
          "base": "形容詞 + くなる",
          "example": "上手だ → 上手になる",
          "example_en": "good at → become good at"
        }
      ]
    },
    "you_ni_mieru_kikoeru": {
      "form": "〜ように見える／聞こえる (Seem / look / sound like)",
      "rules": [
        {
          "base": "動詞普通形 + ように見える",
          "example": "疲れている → 疲れているように見える",
          "example_en": "look tired"
        },
        {
          "base": "動詞普通形 + ように聞こえる",
          "example": "怒っている → 怒っているように聞こえる",
          "example_en": "sound angry"
        }
      ]
    }
  },
  "grammar_points": [
    {
      "point": "〜ようにする (Make an effort to / try to do regularly)",
      "point_en": "Make an effort to / try to",
      "meaning": "習慣的に〜しようと努力する・意識的に〜するようにする",
      "meaning_en": "Try to do something regularly / make a habit of doing something",
      "examples": [
        {
          "jp": "健康のために、毎日30分以上運動するようにしていますが、雨の日はなかなか続けられません。",
          "romaji": "Kenkou no tame ni, mainichi sanjuppun ijou undou suru you ni shite imasu ga, ame no hi wa nakanaka tsuzukeraremasen.",
          "en": "For my health, I make an effort to exercise for at least 30 minutes every day, but on rainy days it's hard to keep it up."
        },
        {
          "jp": "日本語を上達させるために、毎日新しい単語を10個覚えるようにしています。とても効果があります。",
          "romaji": "Nihongo o joutatsu saseru tame ni, mainichi atarashii tango o jukkgo oboeru you ni shite imasu. Totemo kouka ga arimasu.",
          "en": "To improve my Japanese, I try to memorize 10 new words every day. It's very effective."
        },
        {
          "jp": "遅刻しないように、いつも10分早く家を出るようにしていますが、電車が遅れると困ります。",
          "romaji": "Chikoku shinai you ni, itsumo juppun hayaku ie o deru you ni shite imasu ga, densha ga okureru to komarimasu.",
          "en": "To avoid being late, I make sure to leave home 10 minutes earlier, but if the train is delayed, I'm in trouble."
        },
        {
          "jp": "ダイエットのために、夜遅くご飯を食べないようにしています。でもお腹が空くと我慢するのが大変です。",
          "romaji": "Daietto no tame ni, yoru osoku gohan o tabenai you ni shite imasu. Demo onaka ga suku to gaman suru no ga taihen desu.",
          "en": "For dieting, I try not to eat dinner late at night. But when I'm hungry, it's hard to resist."
        },
        {
          "jp": "環境のために、プラスチックをできるだけ使わないようにしています。エコバッグをいつも持ち歩いています。",
          "romaji": "Kankyou no tame ni, purasuchikku o dekiru dake tsukawanai you ni shite imasu. Eko baggu o itsumo mochiaruite imasu.",
          "en": "For the environment, I make an effort to use as little plastic as possible. I always carry an eco bag."
        }
      ]
    },
    {
      "point": "〜ようになる (Come to be able to / become possible / it turns out that)",
      "point_en": "Come to be able to / become ~",
      "meaning": "ある状態になる・できるようになることを表す",
      "meaning_en": "Come to be able to do something / it becomes possible / it turns out that",
      "examples": [
        {
          "jp": "毎日練習したおかげで、日本語がだんだん話せるようになって、すごく嬉しいです。",
          "romaji": "Mainichi renshuu shita okage de, Nihongo ga dandan hanaseru you ni natte, sugoku ureshii desu.",
          "en": "Thanks to practicing every day, I gradually became able to speak Japanese, and I'm really happy about it."
        },
        {
          "jp": "日本に来てから、箸が自然に使えるようになって、自分でも驚いています。",
          "romaji": "Nihon ni kite kara, hashi ga shizen ni tsukaeru you ni natte, jibun demo odoroite imasu.",
          "en": "Since coming to Japan, I've come to be able to use chopsticks naturally, and I'm surprised myself."
        },
        {
          "jp": "この町に住むようになってから、静かな生活がとても心地よいものだと気づきました。",
          "romaji": "Kono machi ni sumu you ni natte kara, shizuka na seikatsu ga totemo kokochi yoi mono da to kizukimashita.",
          "en": "Since I started living in this town, I've come to realize how comfortable a quiet life can be."
        },
        {
          "jp": "長く日本にいるうちに、季節の変わり目が分かるようになって、とても楽しいです。",
          "romaji": "Nagaku Nihon ni iru uchi ni, kisetsu no kawari me ga wakaru you ni natte, totemo tanoshii desu.",
          "en": "After living in Japan for a long time, I've come to be able to notice the change of seasons, and it's very enjoyable."
        },
        {
          "jp": "日本語のドラマをたくさん見るようになってから、日常会話がとても自然に聞こえるようになりました。",
          "romaji": "Nihongo no dorama o takusan miru you ni natte kara, nichijou kaiwa ga totemo shizen ni kikoeru you ni narimashita.",
          "en": "Since I started watching a lot of Japanese dramas, everyday conversations have come to sound very natural to me."
        }
      ]
    },
    {
      "point": "〜ように見える／聞こえる (Seem / look / sound like)",
      "point_en": "Seem / look / sound like",
      "meaning": "見た目や聞こえ方で〜のように感じることを表す",
      "meaning_en": "Look / seem / sound like (based on appearance or impression)",
      "examples": [
        {
          "jp": "彼は疲れているように見えますね。昨日遅くまで仕事していたからでしょうか。",
          "romaji": "Kare wa tsukarete iru you ni miemasu ne. Kinou osoku made shigoto shite ita kara deshou ka.",
          "en": "He looks tired, doesn't he? Maybe because he was working late yesterday."
        },
        {
          "jp": "このケーキはとても美味しそうに見えますが、カロリーが高そうですね。",
          "romaji": "Kono keeki wa totemo oishisou ni miemasu ga, karorii ga takasou desu ne.",
          "en": "This cake looks very delicious, but it seems high in calories, doesn't it?"
        },
        {
          "jp": "あの人は怒っているように聞こえますが、実はただ声が大きいだけかもしれません。",
          "romaji": "Ano hito wa okotte iru you ni kikoemasu ga, jitsu wa tada koe ga ookii dake kamo shiremasen.",
          "en": "That person sounds angry, but maybe it's just that they have a loud voice."
        },
        {
          "jp": "この音楽は悲しいように聞こえますが、実はとても前向きな歌詞なんですよ。",
          "romaji": "Kono ongaku wa kanashii you ni kikoemasu ga, jitsu wa totemo maemuki na kashi nan desu yo.",
          "en": "This music sounds sad, but actually the lyrics are very positive."
        },
        {
          "jp": "彼女は忙しそうに見えますが、実は暇で、遊びに誘ってほしいと思っているかもしれません。",
          "romaji": "Kanojo wa isogashisou ni miemasu ga, jitsu wa hima de, asobi ni sasotte hoshii to omotte iru kamo shiremasen.",
          "en": "She looks busy, but she might actually be free and hoping someone invites her out."
        }
      ]
    }
  ]
},
  
{
  "lesson": 50,
  "title": "みんなの日本語 第50課：謙譲語（お／ご〜します・特別な謙譲語）",
  "english_title": "Minna no Nihongo Lesson 50: Humble Language (kenjougo) – お/ご〜します & Special Humble Forms",
  "level": "N4",
  "connection_structure": {
    "o_go_shimasu": {
      "form": "お／ご〜します (General humble form)",
      "rules": [
        {
          "base": "お + 漢語動詞 + します",
          "example": "お手伝いします",
          "example_en": "help (humbly)"
        },
        {
          "base": "ご + 漢語動詞 + します",
          "example": "ご案内します",
          "example_en": "guide (humbly)"
        }
      ]
    },
    "special_kenjougo_for_others": {
      "form": "特別な謙譲語（目上の人のための行為）",
      "rules": [
        {
          "base": "行く → 参ります / 伺います / 参上します",
          "example": "伺います",
          "example_en": "go/visit (humbly)"
        },
        {
          "base": "来る → 参ります / 伺います / 参上します",
          "example": "参ります",
          "example_en": "come (humbly)"
        },
        {
          "base": "いる → おります",
          "example": "おります",
          "example_en": "be/exist (humbly)"
        },
        {
          "base": "言う → 申します / 申し上げます",
          "example": "申します",
          "example_en": "say (humbly)"
        },
        {
          "base": "する → いたします",
          "example": "いたします",
          "example_en": "do (humbly)"
        }
      ]
    },
    "special_kenjougo_for_self": {
      "form": "特別な謙譲語（自分自身のこと）",
      "rules": [
        {
          "base": "食べる → いただきます",
          "example": "いただきます",
          "example_en": "eat/receive (humbly)"
        },
        {
          "base": "飲む → いただきます",
          "example": "いただきます",
          "example_en": "drink/receive (humbly)"
        },
        {
          "base": "見る → 拝見します",
          "example": "拝見します",
          "example_en": "see/look (humbly)"
        },
        {
          "base": "聞く → 伺います / 拝聴します",
          "example": "伺います",
          "example_en": "hear/ask (humbly)"
        }
      ]
    }
  },
  "grammar_points": [
    {
      "point": "お／ご〜します (General humble form)",
      "point_en": "お/ご〜します – Humble general action",
      "meaning": "自分の動作をへりくだって表現する最も基本的な謙譲語パターン",
      "meaning_en": "Most common humble pattern to lower one's own action for respect",
      "examples": [
        {
          "jp": "お客様のお荷物が重そうですね。私がお持ちしますので、どうぞご安心ください。",
          "romaji": "Okyakusama no onimotsu ga omosou desu ne. Watashi ga omochi shimasu node, douzo goanshin kudasai.",
          "en": "Your luggage looks heavy. I'll carry it for you, so please don't worry."
        },
        {
          "jp": "会議室までご案内します。こちらのエレベーターをお使いください。",
          "romaji": "Kaigishitsu made goannai shimasu. Kochira no erebeetaa o o tsukai kudasai.",
          "en": "I will guide you to the meeting room. Please use this elevator."
        },
        {
          "jp": "資料をお配りしますので、皆さんでご確認いただけますでしょうか。",
          "romaji": "Shiryou o ohakari shimasu node, minasan de go-kakunin itadakemasu deshou ka.",
          "en": "I will distribute the materials, so could everyone please check them?"
        },
        {
          "jp": "お電話をいたしますので、少々お待ちいただけますか。すぐに折り返します。",
          "romaji": "O-denwa o itashimasu node, shou shou omachi itadakemasu ka. Sugu ni orikaeshimasu.",
          "en": "I will call you back, so could you wait a moment? I'll get back to you right away."
        },
        {
          "jp": "お手伝いしますので、何かお困りのことがありましたら遠慮なくおっしゃってください。",
          "romaji": "O-tetsudai shimasu node, nanika o-komari no koto ga arimashitara enryo naku osshatte kudasai.",
          "en": "I will help you, so please don't hesitate to tell me if there's anything you need."
        }
      ]
    },
    {
      "point": "特別な謙譲語（目上の人のための行為）",
      "point_en": "Special humble forms (for actions toward superiors)",
      "meaning": "特定の動詞に対して特別な謙譲語を使う（行く・来る・いる・言う・するなど）",
      "meaning_en": "Special humble verbs for actions directed toward or for superiors",
      "examples": [
        {
          "jp": "明日、部長のお宅に伺いますので、よろしくお願いいたします。",
          "romaji": "Ashita, buchou no otaku ni ukagaimasu node, yoroshiku onegai itashimasu.",
          "en": "I will visit the manager's home tomorrow, so thank you for your kind attention."
        },
        {
          "jp": "会議の資料を拝見いたしました。とても分かりやすくて助かりました。",
          "romaji": "Kaigi no shiryou o haiken itashimashita. Totemo wakariyasukute tasukarimashita.",
          "en": "I have looked over the meeting materials. They were very easy to understand and helpful."
        },
        {
          "jp": "社長は今おりますので、少々お待ちいただけますでしょうか。",
          "romaji": "Shachou wa ima orimasu node, shou shou omachi itadakemasu deshou ka.",
          "en": "The president is here now, so could you wait just a moment?"
        },
        {
          "jp": "後ほどお電話を差し上げます。ご都合の良い時間をお知らせください。",
          "romaji": "Ato hodo o-denwa o sashiagemasu. Go-tsugou no yoi jikan o oshirase kudasai.",
          "en": "I will call you later. Please let me know a convenient time."
        },
        {
          "jp": "本日、貴社にお伺いいたします。10時頃に到着予定でございます。",
          "romaji": "Honjitsu, kisha ni o-ukagai itashimasu. Juuji goro ni touchaku yotei de gozaimasu.",
          "en": "Today I will visit your company. I plan to arrive around 10 o'clock."
        }
      ]
    },
    {
      "point": "特別な謙譲語（自分自身のこと）",
      "point_en": "Special humble forms (for one's own actions)",
      "meaning": "自分自身の動作をへりくだって表現する特別な動詞（食べる・飲む・見る・聞くなど）",
      "meaning_en": "Humble verbs used when describing your own actions toward superiors",
      "examples": [
        {
          "jp": "社長のお話を伺うことができて、とても光栄に存じます。",
          "romaji": "Shachou no o-hanashi o ukagau koto ga dekite, totemo kouei ni zonjimasu.",
          "en": "I feel greatly honored to have the chance to hear the president's words."
        },
        {
          "jp": "お食事をお召し上がりになりますか。私もいただきますので、一緒にどうぞ。",
          "romaji": "O-shokuji o omeshiagari ni narimasu ka. Watashi mo itadakimasu node, issho ni douzo.",
          "en": "Would you like to eat? I will have some too, so please join me."
        },
        {
          "jp": "資料を拝見させていただきました。ご丁寧な説明、ありがとうございます。",
          "romaji": "Shiryou o haiken sasete itadakimashita. Go-teinei na setsumei, arigatou gozaimasu.",
          "en": "I have had the honor of looking over the documents. Thank you for your detailed explanation."
        },
        {
          "jp": "お電話をいただきまして、誠にありがとうございます。すぐに折り返します。",
          "romaji": "O-denwa o itadaki mashite, makoto ni arigatou gozaimasu. Sugu ni orikaeshimasu.",
          "en": "Thank you very much for calling. I will call you back immediately."
        },
        {
          "jp": "お話を伺う機会をいただき、心から感謝しております。貴重なご意見をありがとうございます。",
          "romaji": "O-hanashi o ukagau kikai o itadaki, kokoro kara kansha shite orimasu. Kichou na go-iken o arigatou gozaimasu.",
          "en": "I am truly grateful for the opportunity to hear your words. Thank you for your valuable opinions."
        }
      ]
    }
  ]
}
]
