[
{
  "lesson": 50,
  "title": "みんなの日本語 第50課：謙譲語（お／ご〜します・特別な謙譲語）",
  "english_title": "Minna no Nihongo Lesson 50: Humble Language (kenjougo) – お/ご〜します & Special Humble Forms",
  "level": "N4",
  "connection_structure": {
    "o_go_shimasu": {
      "form": "お／ご〜します (General humble form)",
      "rules": [
        {
          "base": "お + 漢語動詞 + します",
          "example": "お手伝いします",
          "example_en": "help (humbly)"
        },
        {
          "base": "ご + 漢語動詞 + します",
          "example": "ご案内します",
          "example_en": "guide (humbly)"
        }
      ]
    },
    "special_kenjougo_for_others": {
      "form": "特別な謙譲語（目上の人のための行為）",
      "rules": [
        {
          "base": "行く → 参ります / 伺います / 参上します",
          "example": "伺います",
          "example_en": "go/visit (humbly)"
        },
        {
          "base": "来る → 参ります / 伺います / 参上します",
          "example": "参ります",
          "example_en": "come (humbly)"
        },
        {
          "base": "いる → おります",
          "example": "おります",
          "example_en": "be/exist (humbly)"
        },
        {
          "base": "言う → 申します / 申し上げます",
          "example": "申します",
          "example_en": "say (humbly)"
        },
        {
          "base": "する → いたします",
          "example": "いたします",
          "example_en": "do (humbly)"
        }
      ]
    },
    "special_kenjougo_for_self": {
      "form": "特別な謙譲語（自分自身のこと）",
      "rules": [
        {
          "base": "食べる → いただきます",
          "example": "いただきます",
          "example_en": "eat/receive (humbly)"
        },
        {
          "base": "飲む → いただきます",
          "example": "いただきます",
          "example_en": "drink/receive (humbly)"
        },
        {
          "base": "見る → 拝見します",
          "example": "拝見します",
          "example_en": "see/look (humbly)"
        },
        {
          "base": "聞く → 伺います / 拝聴します",
          "example": "伺います",
          "example_en": "hear/ask (humbly)"
        }
      ]
    }
  },
  "grammar_points": [
    {
      "point": "お／ご〜します (General humble form)",
      "point_en": "お/ご〜します – Humble general action",
      "meaning": "自分の動作をへりくだって表現する最も基本的な謙譲語パターン",
      "meaning_en": "Most common humble pattern to lower one's own action for respect",
      "examples": [
        {
          "jp": "お客様のお荷物が重そうですね。私がお持ちしますので、どうぞご安心ください。",
          "romaji": "Okyakusama no onimotsu ga omosou desu ne. Watashi ga omochi shimasu node, douzo goanshin kudasai.",
          "en": "Your luggage looks heavy. I'll carry it for you, so please don't worry."
        },
        {
          "jp": "会議室までご案内します。こちらのエレベーターをお使いください。",
          "romaji": "Kaigishitsu made goannai shimasu. Kochira no erebeetaa o o tsukai kudasai.",
          "en": "I will guide you to the meeting room. Please use this elevator."
        },
        {
          "jp": "資料をお配りしますので、皆さんでご確認いただけますでしょうか。",
          "romaji": "Shiryou o ohakari shimasu node, minasan de go-kakunin itadakemasu deshou ka.",
          "en": "I will distribute the materials, so could everyone please check them?"
        },
        {
          "jp": "お電話をいたしますので、少々お待ちいただけますか。すぐに折り返します。",
          "romaji": "O-denwa o itashimasu node, shou shou omachi itadakemasu ka. Sugu ni orikaeshimasu.",
          "en": "I will call you back, so could you wait a moment? I'll get back to you right away."
        },
        {
          "jp": "お手伝いしますので、何かお困りのことがありましたら遠慮なくおっしゃってください。",
          "romaji": "O-tetsudai shimasu node, nanika o-komari no koto ga arimashitara enryo naku osshatte kudasai.",
          "en": "I will help you, so please don't hesitate to tell me if there's anything you need."
        }
      ]
    },
    {
      "point": "特別な謙譲語（目上の人のための行為）",
      "point_en": "Special humble forms (for actions toward superiors)",
      "meaning": "特定の動詞に対して特別な謙譲語を使う（行く・来る・いる・言う・するなど）",
      "meaning_en": "Special humble verbs for actions directed toward or for superiors",
      "examples": [
        {
          "jp": "明日、部長のお宅に伺いますので、よろしくお願いいたします。",
          "romaji": "Ashita, buchou no otaku ni ukagaimasu node, yoroshiku onegai itashimasu.",
          "en": "I will visit the manager's home tomorrow, so thank you for your kind attention."
        },
        {
          "jp": "会議の資料を拝見いたしました。とても分かりやすくて助かりました。",
          "romaji": "Kaigi no shiryou o haiken itashimashita. Totemo wakariyasukute tasukarimashita.",
          "en": "I have looked over the meeting materials. They were very easy to understand and helpful."
        },
        {
          "jp": "社長は今おりますので、少々お待ちいただけますでしょうか。",
          "romaji": "Shachou wa ima orimasu node, shou shou omachi itadakemasu deshou ka.",
          "en": "The president is here now, so could you wait just a moment?"
        },
        {
          "jp": "後ほどお電話を差し上げます。ご都合の良い時間をお知らせください。",
          "romaji": "Ato hodo o-denwa o sashiagemasu. Go-tsugou no yoi jikan o oshirase kudasai.",
          "en": "I will call you later. Please let me know a convenient time."
        },
        {
          "jp": "本日、貴社にお伺いいたします。10時頃に到着予定でございます。",
          "romaji": "Honjitsu, kisha ni o-ukagai itashimasu. Juuji goro ni touchaku yotei de gozaimasu.",
          "en": "Today I will visit your company. I plan to arrive around 10 o'clock."
        }
      ]
    },
    {
      "point": "特別な謙譲語（自分自身のこと）",
      "point_en": "Special humble forms (for one's own actions)",
      "meaning": "自分自身の動作をへりくだって表現する特別な動詞（食べる・飲む・見る・聞くなど）",
      "meaning_en": "Humble verbs used when describing your own actions toward superiors",
      "examples": [
        {
          "jp": "社長のお話を伺うことができて、とても光栄に存じます。",
          "romaji": "Shachou no o-hanashi o ukagau koto ga dekite, totemo kouei ni zonjimasu.",
          "en": "I feel greatly honored to have the chance to hear the president's words."
        },
        {
          "jp": "お食事をお召し上がりになりますか。私もいただきますので、一緒にどうぞ。",
          "romaji": "O-shokuji o omeshiagari ni narimasu ka. Watashi mo itadakimasu node, issho ni douzo.",
          "en": "Would you like to eat? I will have some too, so please join me."
        },
        {
          "jp": "資料を拝見させていただきました。ご丁寧な説明、ありがとうございます。",
          "romaji": "Shiryou o haiken sasete itadakimashita. Go-teinei na setsumei, arigatou gozaimasu.",
          "en": "I have had the honor of looking over the documents. Thank you for your detailed explanation."
        },
        {
          "jp": "お電話をいただきまして、誠にありがとうございます。すぐに折り返します。",
          "romaji": "O-denwa o itadaki mashite, makoto ni arigatou gozaimasu. Sugu ni orikaeshimasu.",
          "en": "Thank you very much for calling. I will call you back immediately."
        },
        {
          "jp": "お話を伺う機会をいただき、心から感謝しております。貴重なご意見をありがとうございます。",
          "romaji": "O-hanashi o ukagau kikai o itadaki, kokoro kara kansha shite orimasu. Kichou na go-iken o arigatou gozaimasu.",
          "en": "I am truly grateful for the opportunity to hear your words. Thank you for your valuable opinions."
        }
      ]
    }
  ]
}
]
