[
  {
    "id": "https://english.onlinekhabar.com/nepal-eyes-womens-t20-world-cup-spot.html",
    "date": "Wed, 24 Dec 2025 08:37:13 +0000",
    "title": {
      "rendered": "With new coach and home advantage, Nepal eyes Women’s T20 World Cup spot"
    },
    "featured_image": "http://english.onlinekhabar.com/wp-content/uploads/2025/12/harshal-women.jpg",
    "excerpt": {
      "rendered": "The Nepali women’s cricket team is currently busy preparing for the ICC Women’s T20 World Cup Global Qualifier. The team has been training at the Uppe..."
    }
  },
  {
    "id": "https://english.onlinekhabar.com/tiger-cup-volleyball-from-january-23.html",
    "date": "Wed, 24 Dec 2025 08:01:59 +0000",
    "title": {
      "rendered": "Tiger Cup Volleyball from January 23"
    },
    "featured_image": "http://english.onlinekhabar.com/wp-content/uploads/2020/09/Volleyball.jpg",
    "excerpt": {
      "rendered": "Kaski, December 24\n\n\n\nThe 6th edition of the ‘Tiger Cup’ National/International Invitational Open Club Championship Volleyball Tournament is set to be..."
    }
  },
  {
    "id": "https://english.onlinekhabar.com/womens-t20-world-cup-global-qualifier-groups-and-schedule-announced.html",
    "date": "Tue, 23 Dec 2025 11:37:51 +0000",
    "title": {
      "rendered": "Women’s T20 World Cup global qualifier groups and schedule announced"
    },
    "featured_image": "http://english.onlinekhabar.com/wp-content/uploads/2025/12/women1.png",
    "excerpt": {
      "rendered": "Kathmandu, December 23\n\n\n\nThe groupings and match schedule for the ICC Women’s T20 World Cup Global Qualifier, to be held in Kathmandu next January, h..."
    }
  },
  {
    "id": "https://english.onlinekhabar.com/cameron-green-becomes-ipls-most-expensive-overseas-player.html",
    "date": "Tue, 16 Dec 2025 10:07:37 +0000",
    "title": {
      "rendered": "Cameron Green becomes IPL’s most expensive overseas player"
    },
    "excerpt": {
      "rendered": "Kathmandu, December 16 Australian all-rounder Cameron Green has become the most expensive overseas player in the history of the Indian Premier League ..."
    },
    "content": {
      "rendered": "<p>Kathmandu, December 16 Australian all-rounder Cameron Green has become the most expensive overseas player in the history of the Indian Premier League (IPL). During the IPL auction held on Tuesday, Green was signed by the Kolkata Knight Riders for INR 25.20 crore. Previously, the record for the most expensive foreign player was held by fellow [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/cameron-green-becomes-ipls-most-expensive-overseas-player.html\">Cameron Green becomes IPL’s most expensive overseas player</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/harshal-jayant-pathak-head-coach.html",
    "date": "Tue, 16 Dec 2025 06:27:32 +0000",
    "title": {
      "rendered": "Harshal Jayant Pathak named Head Coach of Nepal women’s cricket team"
    },
    "excerpt": {
      "rendered": "Kathmandu, December 16&#160; Harshal Jayant Pathak of India has been appointed as the head coach of the Nepali women’s cricket team, becoming the firs..."
    },
    "content": {
      "rendered": "<p>Kathmandu, December 16&#160; Harshal Jayant Pathak of India has been appointed as the head coach of the Nepali women’s cricket team, becoming the first foreign coach to take charge of the women’s side. The Cricket Association of Nepal (CAN) had invited applications to appoint a foreign coach ahead of the upcoming Women’s T20 World Cup [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/harshal-jayant-pathak-head-coach.html\">Harshal Jayant Pathak named Head Coach of Nepal women’s cricket team</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/lumbini-lions-win-npl-season-2.html",
    "date": "Sat, 13 Dec 2025 12:50:10 +0000",
    "title": {
      "rendered": "After remarkable turnaround, Lumbini Lions lift NPL title"
    },
    "excerpt": {
      "rendered": "Lumbini Lions defeated defending runners-up Sudurpaschim Royals to win the Siddhartha Bank Nepal Premier League (NPL) title on Saturday at the Tribhuv..."
    },
    "content": {
      "rendered": "<p>Lumbini Lions defeated defending runners-up Sudurpaschim Royals to win the Siddhartha Bank Nepal Premier League (NPL) title on Saturday at the Tribhuvan University International Cricket Ground. With the victory, Lumbini have been crowned new NPL champions, while Sudurpaschim Royals finished runners-up for the second consecutive time. After captain Rohit Paudel, Sher Malla, and Ruben Trumpelmann [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/lumbini-lions-win-npl-season-2.html\">After remarkable turnaround, Lumbini Lions lift NPL title</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/nepals-swikrit-neupane-clinches-silver-at-asian-youth-para-games.html",
    "date": "Fri, 12 Dec 2025 09:21:46 +0000",
    "title": {
      "rendered": "Nepal’s Swikrit Neupane clinches silver at Asian Youth Para Games"
    },
    "excerpt": {
      "rendered": "Kathmandu, December 12 Nepali para table tennis player Swikrit Neupane has won a silver medal at the Asian Youth Para Games currently underway in Duba..."
    },
    "content": {
      "rendered": "<p>Kathmandu, December 12 Nepali para table tennis player Swikrit Neupane has won a silver medal at the Asian Youth Para Games currently underway in Dubai, United Arab Emirates. Neupane secured the medal in the U-23 Men’s Singles (Class 7) category. In the final match held on Thursday, he was defeated 3–2 by Ren-Ting Huang of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/nepals-swikrit-neupane-clinches-silver-at-asian-youth-para-games.html\">Nepal’s Swikrit Neupane clinches silver at Asian Youth Para Games</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/lumbini-lions-reach-npl-fina.html",
    "date": "Thu, 11 Dec 2025 13:55:43 +0000",
    "title": {
      "rendered": "Lumbini Lions reach NPL final for the first time"
    },
    "excerpt": {
      "rendered": "Kathmandu, December 11 Lumbini Lions have reached the final of the Siddhartha Bank Nepal Premier League (NPL) for the first time. In the second qualif..."
    },
    "content": {
      "rendered": "<p>Kathmandu, December 11 Lumbini Lions have reached the final of the Siddhartha Bank Nepal Premier League (NPL) for the first time. In the second qualifier held on Thursday, Lumbini secured their place in the final of the second edition by defeating Biratnagar Kings by 40 runs. Lumbini will now face Sudurpaschim Royals for the title. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/lumbini-lions-reach-npl-fina.html\">Lumbini Lions reach NPL final for the first time</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/npl-final-to-decide-today.html",
    "date": "Thu, 11 Dec 2025 05:20:44 +0000",
    "title": {
      "rendered": "NPL finalist to be decided today between Biratnagar and Lumbini"
    },
    "excerpt": {
      "rendered": "Kathmandu, December 11 Two matches and three teams remain in the Siddhartha Bank Nepal Premier League (NPL) Cricket 2025. Among the three, Sudurpaschi..."
    },
    "content": {
      "rendered": "<p>Kathmandu, December 11 Two matches and three teams remain in the Siddhartha Bank Nepal Premier League (NPL) Cricket 2025. Among the three, Sudurpaschim Royals have already secured their place in the final. The second finalist will be decided today. The second qualifier is taking place today, where Biratnagar Kings and Lumbini Lions will face each [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/npl-final-to-decide-today.html\">NPL finalist to be decided today between Biratnagar and Lumbini</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/kathmandu-and-lumbini-npl.html",
    "date": "Wed, 10 Dec 2025 07:51:30 +0000",
    "title": {
      "rendered": "Kathmandu and Lumbini to clash in high-stakes NPL eliminator"
    },
    "excerpt": {
      "rendered": "In the second edition of the Siddhartha Bank Nepal Premier League (NPL) cricket tournament, Kathmandu Gorkhas and Lumbini Lions, the two teams that se..."
    },
    "content": {
      "rendered": "<p>In the second edition of the Siddhartha Bank Nepal Premier League (NPL) cricket tournament, Kathmandu Gorkhas and Lumbini Lions, the two teams that secured their first-ever playoff berths, are facing each other today in the Eliminator. The match, which begins at 4 PM at the TU Cricket Ground, will decide which one of the two [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/kathmandu-and-lumbini-npl.html\">Kathmandu and Lumbini to clash in high-stakes NPL eliminator</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/four-npl-playoff-contenders.html",
    "date": "Tue, 09 Dec 2025 02:58:30 +0000",
    "title": {
      "rendered": "Breaking down the four NPL playoff contenders"
    },
    "excerpt": {
      "rendered": "The league-stage matches of Siddhartha Bank Nepal Premier League 2025 have concluded. On Sunday, in the final league match, the Karnali Yaks defeated ..."
    },
    "content": {
      "rendered": "<p>The league-stage matches of Siddhartha Bank Nepal Premier League 2025 have concluded. On Sunday, in the final league match, the Karnali Yaks defeated the Janakpur Bolts by three runs, bringing the league-stage points table to a close. Even before this match, the four teams qualifying for the playoffs had already been confirmed. In the first [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/four-npl-playoff-contenders.html\">Breaking down the four NPL playoff contenders</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/npl-cricket-2025-final-game-of-league-stage-taking-place-today.html",
    "date": "Sun, 07 Dec 2025 04:50:00 +0000",
    "title": {
      "rendered": "NPL Cricket 2025: Final game of league stage taking place today"
    },
    "excerpt": {
      "rendered": "Kathmandu, December 7 The final game of the league stage is being played today in the second edition of the Nepal Premier League (NPL) underway in Kat..."
    },
    "content": {
      "rendered": "<p>Kathmandu, December 7 The final game of the league stage is being played today in the second edition of the Nepal Premier League (NPL) underway in Kathmandu. Karnali Yaks and defending champions Janakpur Bolts are taking on in the match to be held at 3.30 pm in the TU International Cricket Stadium. Both teams have [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/npl-cricket-2025-final-game-of-league-stage-taking-place-today.html\">NPL Cricket 2025: Final game of league stage taking place today</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/nepali-bowler-dominates-npl.html",
    "date": "Fri, 05 Dec 2025 09:49:28 +0000",
    "title": {
      "rendered": "Foreign bats dominate while Nepali bowlers seize control in a tightening NPL playoff race"
    },
    "excerpt": {
      "rendered": "In an ongoing second edition of the Nepal Premier League (NPL), 24 matches have been completed so far. The league stage is almost about to end, and th..."
    },
    "content": {
      "rendered": "<p>In an ongoing second edition of the Nepal Premier League (NPL), 24 matches have been completed so far. The league stage is almost about to end, and three teams, Sudurpaschim Royals, Kathmandu Gorkhas, and Biratnagar Kings have already secured their places in the playoffs. Four other teams remain in contention for the final playoff spot. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/nepali-bowler-dominates-npl.html\">Foreign bats dominate while Nepali bowlers seize control in a tightening NPL playoff race</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/saff-womens-club-championshio-today.html",
    "date": "Fri, 05 Dec 2025 06:30:40 +0000",
    "title": {
      "rendered": "SAFF Women’s Club Championship to begin from today"
    },
    "excerpt": {
      "rendered": "Kathmandu, December 5 The first edition of the SAFF Women’s Club Championship is kicking off today in Kathmandu.&#160; This tournament marks the begin..."
    },
    "content": {
      "rendered": "<p>Kathmandu, December 5 The first edition of the SAFF Women’s Club Championship is kicking off today in Kathmandu.&#160; This tournament marks the beginning of a new chapter in South Asian football. Two matches will be played on the opening day at the Dasharath Stadium in Tripureshwar.&#160; The first match, between Transport United Ladies FC of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/saff-womens-club-championshio-today.html\">SAFF Women’s Club Championship to begin from today</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/kathmandu-gorkhas-clinch-playoff.html",
    "date": "Thu, 04 Dec 2025 11:04:50 +0000",
    "title": {
      "rendered": "Kathmandu Gorkhas clinch playoff berth after Alam’s dominant six-wicket display"
    },
    "excerpt": {
      "rendered": "Kathmandu, December 4&#160; After Shahab Alam’s spectacular bowling performance taking six wickets, Kathmandu Gorkhas became the second team to secure..."
    },
    "content": {
      "rendered": "<p>Kathmandu, December 4&#160; After Shahab Alam’s spectacular bowling performance taking six wickets, Kathmandu Gorkhas became the second team to secure a spot in the playoffs of the Nepal Premier League (NPL).  In Thursday’s first match, Kathmandu defeated Pokhara Avengers by 13 runs, securing a playoff spot and strengthening their chances of finishing in the top [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/kathmandu-gorkhas-clinch-playoff.html\">Kathmandu Gorkhas clinch playoff berth after Alam’s dominant six-wicket display</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/nepals-cricket-finds-fresh-energy.html",
    "date": "Wed, 03 Dec 2025 07:45:43 +0000",
    "title": {
      "rendered": "With foreign talent and rising crowds, Nepal’s cricket finds fresh energy"
    },
    "excerpt": {
      "rendered": "Right now in Nepal, as the clock strikes either 11 am or 4 pm, thousands of people get excited about the same thing, watching the Nepal Premier League..."
    },
    "content": {
      "rendered": "<p>Right now in Nepal, as the clock strikes either 11 am or 4 pm, thousands of people get excited about the same thing, watching the Nepal Premier League. Cricket, over the past few years, has gained immense popularity among Nepalis as the national team has achieved major milestones, such as playing in the World Cup [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/nepals-cricket-finds-fresh-energy.html\">With foreign talent and rising crowds, Nepal’s cricket finds fresh energy</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/npl-maaz-and-anils-half-centuries-give-janakpur-their-first-win.html",
    "date": "Tue, 02 Dec 2025 10:46:54 +0000",
    "title": {
      "rendered": "NPL: Maaz and Anil’s half-centuries give Janakpur their first win"
    },
    "excerpt": {
      "rendered": "Kathmandu, December 2 Half-centuries from Anil Shah and Maaz Sadaqat powered defending champions Janakpur Bolts to their first victory in the Siddhart..."
    },
    "content": {
      "rendered": "<p>Kathmandu, December 2 Half-centuries from Anil Shah and Maaz Sadaqat powered defending champions Janakpur Bolts to their first victory in the Siddhartha Bank Nepal Premier League (NPL) 2025, ending a four-match winless run. Chasing Chitwan Rhinos’ target of 177, Janakpur reached 178 for 4 in 17.3 overs, thanks to the commanding innings from Maaz and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/npl-maaz-and-anils-half-centuries-give-janakpur-their-first-win.html\">NPL: Maaz and Anil’s half-centuries give Janakpur their first win</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/acc-u-19-premier-cup-nepal-facing-uae-today.html",
    "date": "Mon, 01 Dec 2025 07:29:00 +0000",
    "title": {
      "rendered": "ACC U-19 Premier Cup: Nepal facing UAE today"
    },
    "excerpt": {
      "rendered": "File Kathmandu, December 1 Nepal is facing hosts the UAE today in the championship-decider match to be held under the ACC Men&#8217;s U-19 ODI Premier..."
    },
    "content": {
      "rendered": "<p>File Kathmandu, December 1 Nepal is facing hosts the UAE today in the championship-decider match to be held under the ACC Men&#8217;s U-19 ODI Premier Cup. The title match started at 10:30 am local time today at the Karwan Ground in Ajman of the United Arab Emirates (UAE). Nepal has defeated Malaysia by 9 wickets [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/acc-u-19-premier-cup-nepal-facing-uae-today.html\">ACC U-19 Premier Cup: Nepal facing UAE today</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/npl-2025-no-matches-today-two-matches-on-tuesday.html",
    "date": "Mon, 01 Dec 2025 07:13:34 +0000",
    "title": {
      "rendered": "NPL 2025: No matches today, two matches on Tuesday"
    },
    "excerpt": {
      "rendered": "Kathmandu, December 1 No matches are being played under the Nepal Premier League 2025 today, as Monday has been designated as a rest day. The franchis..."
    },
    "content": {
      "rendered": "<p>Kathmandu, December 1 No matches are being played under the Nepal Premier League 2025 today, as Monday has been designated as a rest day. The franchise-based Twenty20 cricket tournament hosted by Cricket Association of Nepal (CAN) will resume tomorrow with two matches. In the first match to begin at 11:45 am, Chitwan Rhinos will face [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/npl-2025-no-matches-today-two-matches-on-tuesday.html\">NPL 2025: No matches today, two matches on Tuesday</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/npl-2025-karnali-to-face-kathmandu-today.html",
    "date": "Sun, 30 Nov 2025 07:09:59 +0000",
    "title": {
      "rendered": "NPL 2025: Karnali to face Kathmandu today"
    },
    "excerpt": {
      "rendered": "Kathmandu, November 30 Karnali Yaks is playing against Kathmandu Gorkhas in the only match of the day under the second season of Nepal Premier League ..."
    },
    "content": {
      "rendered": "<p>Kathmandu, November 30 Karnali Yaks is playing against Kathmandu Gorkhas in the only match of the day under the second season of Nepal Premier League (NPL). The match is scheduled to start at 3:30 pm at the Tribhuvan University International Cricket Stadium. Karnali Yaks remain in the sixth position in the points table with only [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/npl-2025-karnali-to-face-kathmandu-today.html\">NPL 2025: Karnali to face Kathmandu today</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/chitwan-rhinos-lose-to-kathmandu.html",
    "date": "Fri, 28 Nov 2025 09:35:09 +0000",
    "title": {
      "rendered": "Weak batting sees Chitwan Rhinos lose to Kathmandu Gorkhas"
    },
    "excerpt": {
      "rendered": "Kathmandu, November 28&#160; Chitwan Rhinos suffered a tough 53-run defeat against Kathmandu Gorkhas, largely due to weak batting. Chitwan failed to c..."
    },
    "content": {
      "rendered": "<p>Kathmandu, November 28&#160; Chitwan Rhinos suffered a tough 53-run defeat against Kathmandu Gorkhas, largely due to weak batting. Chitwan failed to chase the moderate target of 143 runs set by Kathmandu. In the first innings, Sohail Tanvir of Chitwan took 4 wickets, while Jon Simpson of Kathmandu anchored Kathmandu’s innings with 60 runs. In the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/chitwan-rhinos-lose-to-kathmandu.html\">Weak batting sees Chitwan Rhinos lose to Kathmandu Gorkhas</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/npl-360-degree-view-tu-cricket-ground.html",
    "date": "Fri, 28 Nov 2025 06:07:34 +0000",
    "title": {
      "rendered": "A 360-degree look at TU International Cricket Ground during the NPL (Photos)"
    },
    "excerpt": {
      "rendered": "As the Nepal Premier League is taking place at the Tribhuvan University International Cricket Ground, Kirtipur, thousands of cricket lovers gather eac..."
    },
    "content": {
      "rendered": "<p>As the Nepal Premier League is taking place at the Tribhuvan University International Cricket Ground, Kirtipur, thousands of cricket lovers gather each day to show their support for their teams. In this second edition of the league, matches are also being held under floodlights, adding extra excitement for Nepal’s cricket fans. Onlinekhabar on Thursday captured [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/npl-360-degree-view-tu-cricket-ground.html\">A 360-degree look at TU International Cricket Ground during the NPL (Photos)</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  },
  {
    "id": "https://english.onlinekhabar.com/npl-cricket-2025-two-matches-today.html",
    "date": "Fri, 28 Nov 2025 05:29:39 +0000",
    "title": {
      "rendered": "NPL Cricket 2025: Two matches today"
    },
    "excerpt": {
      "rendered": "Kathmandu, November 28 Two matches are to take place today under the Nepal Premier League (NPL) of second edition underway in Kathmandu. In the TU Int..."
    },
    "content": {
      "rendered": "<p>Kathmandu, November 28 Two matches are to take place today under the Nepal Premier League (NPL) of second edition underway in Kathmandu. In the TU International Cricket Ground, the first match between Chitwan Rhinos and Kathmandu Gorkhas will take place at 11.45 am while the second match between Karnali Yaks and Biratnagar Kings is scheduled [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com/npl-cricket-2025-two-matches-today.html\">NPL Cricket 2025: Two matches today</a> appeared first on <a rel=\"nofollow\" href=\"https://english.onlinekhabar.com\">OnlineKhabar English News</a>.</p>\n"
    },
    "featured_image": "https://via.placeholder.com/1080x1920?text=Sports"
  }
]